


#*****************************************************************************
lst=['a','s','d','f','g']
print(lst[-1])
print(lst[-2])
print(lst[-3])
print(lst[-4])
print(lst[-5])

#*****************************************************************************
import math as m                                 # подключить модуль math и бращатся к нему через "m"
a=m.sin(m.radians(0))                            # вычисление sin 00 градусов дуги
b=m.sin(m.radians(90))                           # вычисление sin 90 градусов дуги
c=round (m.sin(m.radians(180)), 1)               # round-необходима для исключения ошибки окр-й при вычислении sin
d=m.sin(m.radians(270))                          # вычисление sin 270 градусов дуги
e=round (m.sin(m.radians(360)), 1)               # round-необходима для исключения ошибки окр-й при вычислении sin

print(a, b, c, d, e, sep='->')
print(m.pi)
#*****************************************************************************
n=4
lst = [[1], [1,1]]
b=[1]

for i in range(2, n+1):
    lst.append([1])
    for k in range(1,i):
        lst[i].append(lst[i-1][k-1]+lst[i-1][k])

    lst[i]=lst[i]+b

    print(lst[i])
print(lst)

#*****************************************************************************




#*****************************************************************************
